; domain
(define (domain UpdsideDown)

    (:requirements
        :typing
        :negative-preconditions
        :conditional-effects
    )

    (:types
        matches keys - items
        cells
        colour
    )

    (:predicates
        ;Predicates about matches
        (match-fire) ;Match on fire 
        
        ;Predicates about keys
        (key-infinite-uses ?key - keys) ;Key usage infinite
        (key-two-use ?key - keys) ;Key usage one time remaining 
        (key-one-use ?key - keys) ;Key usage two times remaining
        (key-used-up ?key - keys) ;Key used up
        (key-colour ?key - keys ?colour - colour) ;Key colour
        
        ;Predicates about cells
        (cell-has-hero ?cell - cells) ;Cell has the hero
        (cell-has-monster ?cell - cells) ;Cell has the monster
        (cell-has-key ?key -keys ?cell - cells) ;Cell has a key
        (cell-has-match ?match - matches ?cell - cells) ;Cell has a match
        (cell-has-gate-open ?cell - cells ?colour - colour) ;Cell has an open gate
        (cell-has-gate-closed ?cell - cells) ;Cell has a closed gate
        (cell-visited ?cell - cells) ;Cell has been visited
        (cell-connected ?cell-a ?cell-b - cells) ;Two cells are connected
        
        ;Predicates about hero
        (hero-hand-empty) ;Hero holds nothing
        (hero-has-key ?key - keys) ;Hero holds a key
        (hero-has-match ?match - matches) ;Hero holds a match
    )

    ;When this action is executed, hero move between cells, and the original cell becomes invigilated.
    (:action move
        :parameters (?from ?to - cells)
        :precondition (and
            ;Hero is at "from" location
            (cell-has-hero ?from)
            ;"To" location not visited
            (not (cell-visited ?to))
            ;Two cells are connected
            (cell-connected ?from ?to)
            ;(or (cell-connected ?from ?to) (cell-connected ?to ?from))
            ;Not consider monsters here
            (not (cell-has-monster ?from))
            (not (cell-has-monster ?to))
        )
        :effect (and 
            ;Hero is not at "from" location
            (not (cell-has-hero ?from))
            ;Hero is at "to" location
            (cell-has-hero ?to)
            ;"From" location has been visited
            (cell-visited ?from)
            ;Match should not on fire once move
            (not (match-fire))
        )
    )
    
    ;When this action is executed, the hero leaves a location with a monster in it
    (:action move-out-of-monster
        :parameters (?from ?to - cells)
        :precondition (and
            ;Hero is at "from" location
            (cell-has-hero ?from)
            ;"To" location not visited
            (not (cell-visited ?to))
            ;Two cells are connected
            (cell-connected ?from ?to)
            ;(or (cell-connected ?from ?to) (cell-connected ?to ?from))
            ;Monster is at "from" location
            (cell-has-monster ?from)
            ;Monster is not at "to" location
            (not (cell-has-monster ?to))
            ;Match on fire
            (match-fire)
        )
        :effect (and
            ;Hero is not at "from" location
            (not (cell-has-hero ?from))
            ;Hero is at "to" location
            (cell-has-hero ?to)
            ;"From" location has been visited
            (cell-visited ?from)
            ;Match should not on fire once move
            (not (match-fire))
        )
    )

    ;When this action is executed, the hero leaves a location without a monster and gets into a location with a monster
    (:action move-into-monster
        :parameters (?from ?to - cells ?m - matches)
        :precondition (and
            ;Hero is at "from" location
            (cell-has-hero ?from)
            ;"To" location not visited
            (not (cell-visited ?to))
            ;Two cells are connected
            (cell-connected ?from ?to)
            ;(or (cell-connected ?from ?to) (cell-connected ?to ?from))
            ;Monster is at "to" location
            (cell-has-monster ?to)
            ;Monster is not at "from" location
            (not (cell-has-monster ?from))
            ;Hero has a match
            (hero-has-match ?m)
        )
        :effect (and 
            ;Hero is not at "from" location
            (not (cell-has-hero ?from))
            ;Hero is at "to" location
            (cell-has-hero ?to)      
            ;"From" location has been visited
            (cell-visited ?from)
            ;Match should not on fire once move
            (not (match-fire))
        )
    )
    
    ;Hero's picks a key if he's in the same location
    (:action pick-key
        :parameters (?loc - cells ?k - keys)
        :precondition (and 
            ;Current location has a key
            (cell-has-key ?k ?loc)
            ;Current location has the hero
            (cell-has-hero ?loc)
            ;Hero hands empty
            (hero-hand-empty)
        )
        :effect (and
            ;Current location has no key
            (not (cell-has-key ?k ?loc))
            ;Hero holds the key
            (hero-has-key ?k)
            ;Hero hands not empty
            (not (hero-hand-empty))
        )
    )

    ;Hero's picks a match if he's in the same location
    (:action pick-match
        :parameters (?loc - cells ?m - matches)
        :precondition (and 
            ;Current location has a match
            (cell-has-match ?m ?loc)
            ;Current location has the hero
            (cell-has-hero ?loc)
            ;Hero hands empty
            (hero-hand-empty)
        )
        :effect (and
            ;Current location has no match
            (not (cell-has-match ?m ?loc))
            ;Hero holds the match
            (hero-has-match ?m)
            ;Hero hands not empty
            (not (hero-hand-empty))
        )
    )
    
   ;Hero's drops his key. 
    (:action drop-key
        :parameters (?loc - cells ?k - keys)
        :precondition (and
            ;Current location has the hero
            (cell-has-hero ?loc)
            ;Hero holds the key
            (hero-has-key ?k)
        )
        :effect (and
            ;Current location has a key
            (cell-has-key ?k ?loc)
            ;Hero hands empty
            (hero-hand-empty)
            ;Hero not holds the key
            (not (hero-has-key ?k))
        )
    )

    ;Hero's drops his match. 
    (:action drop-match
        :parameters (?loc - cells ?m - matches)
        :precondition (and 
            ;Current location has the hero
            (cell-has-hero ?loc)
            ;Hero holds the match
            (hero-has-match ?m)
        )
        :effect (and
            ;Current location has a match
            (cell-has-match ?m ?loc)
            ;Hero hands empty
            (hero-hand-empty)
            ;Hero not holds the match
            (not (hero-has-match ?m))
        )
    )
    
    ;Hero's disarm the trap with his hand
    (:action close-gate
        :parameters (?from ?to - cells ?k - keys ?c - colour)
        :precondition (and
            ;Hero is at "from" location
            (cell-has-hero ?from)
            ;Two cells are connected
            (cell-connected ?from ?to)
            ;(or (cell-connected ?from ?to) (cell-connected ?to ?from))
            ;"To" cell has an open gate
            (cell-has-gate-open ?to ?c)
            ;Hero holds a key
            (hero-has-key ?k)
            ;Key colour matches gate colour
            (key-colour ?k ?c)
            ;Key is still usable
            (or (key-infinite-uses ?k) (key-two-use ?k) (key-one-use ?k))
        )
        :effect (and
            ;"To" cell has a closed gate
            (cell-has-gate-closed ?to)
            ;When a key has two uses, then it becomes a single use
            (when (key-two-use ?k) (key-one-use ?k))
            ;When a key has a single use, it becomes used-up
            (when (key-one-use ?k) (key-used-up ?k))       
        )
    )

    ;Hero strikes her match
    (:action strike-match
        :parameters (?m - matches)
        :precondition (and 
            ;Hero holds a match
            (hero-has-match ?m)
        )
        :effect (and 
            ;Match on fire
            (match-fire)               
        )
    )
    
)

; problem
(define (problem p2-UpdsideDown)

    (:domain UpdsideDown)
  
    (:objects
    
        cell-1 cell-2 cell- cell-3 cell-4 cell-5 cell-6 cell-7 cell-8 cell-9 cell-10 cell-11 cell-12 cell-13 cell-14 cell-15 - cells
        red green blue - colour
        m1 m2 - matches
        k1 k2 - keys

    )
  
    (:init
  
        ;Initial Hero Location
        (cell-has-hero cell-1)
        
        ;She starts with a free arm
        (hero-hand-empty)
        
        ;Initial location of the keys
        (cell-has-key k1 cell-1)
        (cell-has-key k2 cell-11)
        
        ;Initial location of the matches
        (cell-has-match m1 cell-6)
        (cell-has-match m2 cell-13)
        
        ;Initial location of Monsters
        (cell-has-monster cell-14)
        
        ;Initial lcocation of open gates
        (cell-has-gate-open cell-2 red)
        (cell-has-gate-open cell-3 red)
        (cell-has-gate-open cell-4 red)
        (cell-has-gate-open cell-5 red)
        (cell-has-gate-open cell-7 red)
        (cell-has-gate-open cell-8 red)
        (cell-has-gate-open cell-9 red)
        (cell-has-gate-open cell-10 red)
        (cell-has-gate-open cell-12 green)
        
        ;Key uses
        (key-infinite-uses k1)
        (key-two-use k2)
        
        ;Key Colours
        (key-colour k1 red)
        (key-colour k2 green)
        
        ;Graph Connectivity
        (cell-connected cell-1 cell-3)
        (cell-connected cell-3 cell-1)
        (cell-connected cell-2 cell-3)
        (cell-connected cell-3 cell-2)
        (cell-connected cell-3 cell-4)
        (cell-connected cell-4 cell-3)
        (cell-connected cell-2 cell-5)
        (cell-connected cell-5 cell-2)
        (cell-connected cell-2 cell-6)
        (cell-connected cell-6 cell-2)
        (cell-connected cell-3 cell-6)
        (cell-connected cell-6 cell-3)
        (cell-connected cell-4 cell-6)
        (cell-connected cell-6 cell-4)
        (cell-connected cell-4 cell-7)
        (cell-connected cell-7 cell-4)
        (cell-connected cell-5 cell-6)
        (cell-connected cell-6 cell-5)
        (cell-connected cell-6 cell-7)
        (cell-connected cell-7 cell-6)
        (cell-connected cell-5 cell-8)
        (cell-connected cell-8 cell-5)
        (cell-connected cell-6 cell-8)
        (cell-connected cell-8 cell-6)
        (cell-connected cell-6 cell-9)
        (cell-connected cell-9 cell-6)
        (cell-connected cell-6 cell-10)
        (cell-connected cell-10 cell-6)
        (cell-connected cell-7 cell-10)
        (cell-connected cell-10 cell-7)
        (cell-connected cell-8 cell-9)
        (cell-connected cell-9 cell-8)
        (cell-connected cell-9 cell-10)
        (cell-connected cell-10 cell-9)
        (cell-connected cell-9 cell-11)
        (cell-connected cell-11 cell-9)
        (cell-connected cell-11 cell-12)
        (cell-connected cell-12 cell-11)
        (cell-connected cell-12 cell-13)
        (cell-connected cell-13 cell-12)
        (cell-connected cell-13 cell-14)
        (cell-connected cell-14 cell-13)
        (cell-connected cell-14 cell-15)
        (cell-connected cell-15 cell-14)
    
    )
  
    (:goal 
        (and
        
            ;Hero's Goal Location
            (cell-has-hero cell-15)
            
            ;All gates are closed
            (cell-has-gate-closed cell-2)
            (cell-has-gate-closed cell-3)
            (cell-has-gate-closed cell-4)
            (cell-has-gate-closed cell-5)
            (cell-has-gate-closed cell-7)
            (cell-has-gate-closed cell-8)
            (cell-has-gate-closed cell-9)
            (cell-has-gate-closed cell-10)
            (cell-has-gate-closed cell-12)
                
        )
    )
  
)

; plan
1. (pick-key cell-1 k1)
   deleted: (cell-has-key k1 cell-1) (hero-hand-empty)
   added: (hero-has-key k1)
   goals met: 0 of 10
2. (close-gate cell-1 cell-3 k1 red)
   added: (cell-has-gate-closed cell-3)
   goals met: 1 of 10
3. (move cell-1 cell-3)
   deleted: (cell-has-hero cell-1)
   added: (cell-has-hero cell-3) (cell-visited cell-1)
   goals met: 1 of 10
4. (close-gate cell-3 cell-4 k1 red)
   added: (cell-has-gate-closed cell-4)
   goals met: 2 of 10
5. (close-gate cell-3 cell-2 k1 red)
   added: (cell-has-gate-closed cell-2)
   goals met: 3 of 10
6. (move cell-3 cell-6)
   deleted: (cell-has-hero cell-3)
   added: (cell-has-hero cell-6) (cell-visited cell-3)
   goals met: 3 of 10
7. (close-gate cell-6 cell-10 k1 red)
   added: (cell-has-gate-closed cell-10)
   goals met: 4 of 10
8. (close-gate cell-6 cell-9 k1 red)
   added: (cell-has-gate-closed cell-9)
   goals met: 5 of 10
9. (close-gate cell-6 cell-8 k1 red)
   added: (cell-has-gate-closed cell-8)
   goals met: 6 of 10
10. (close-gate cell-6 cell-7 k1 red)
   added: (cell-has-gate-closed cell-7)
   goals met: 7 of 10
11. (close-gate cell-6 cell-5 k1 red)
   added: (cell-has-gate-closed cell-5)
   goals met: 8 of 10
12. (move cell-6 cell-9)
   deleted: (cell-has-hero cell-6)
   added: (cell-has-hero cell-9) (cell-visited cell-6)
   goals met: 8 of 10
13. (move cell-9 cell-11)
   deleted: (cell-has-hero cell-9)
   added: (cell-has-hero cell-11) (cell-visited cell-9)
   goals met: 8 of 10
14. (drop-key cell-11 k1)
   deleted: (hero-has-key k1)
   added: (cell-has-key k1 cell-11) (hero-hand-empty)
   goals met: 8 of 10
15. (pick-key cell-11 k2)
   deleted: (cell-has-key k2 cell-11) (hero-hand-empty)
   added: (hero-has-key k2)
   goals met: 8 of 10
16. (close-gate cell-11 cell-12 k2 green)
   added: (cell-has-gate-closed cell-12) (key-one-use k2)
   goals met: 9 of 10
17. (drop-key cell-11 k2)
   deleted: (hero-has-key k2)
   added: (cell-has-key k2 cell-11) (hero-hand-empty)
   goals met: 9 of 10
18. (move cell-11 cell-12)
   deleted: (cell-has-hero cell-11)
   added: (cell-has-hero cell-12) (cell-visited cell-11)
   goals met: 9 of 10
19. (move cell-12 cell-13)
   deleted: (cell-has-hero cell-12)
   added: (cell-has-hero cell-13) (cell-visited cell-12)
   goals met: 9 of 10
20. (pick-match cell-13 m2)
   deleted: (cell-has-match m2 cell-13) (hero-hand-empty)
   added: (hero-has-match m2)
   goals met: 9 of 10
21. (move-into-monster cell-13 cell-14 m2)
   deleted: (cell-has-hero cell-13)
   added: (cell-has-hero cell-14) (cell-visited cell-13)
   goals met: 9 of 10
22. (strike-match m2)
   added: (match-fire)
   goals met: 9 of 10
23. (move-out-of-monster cell-14 cell-15)
   deleted: (cell-has-hero cell-14) (match-fire)
   added: (cell-has-hero cell-15) (cell-visited cell-14)
   goals met: 10 of 10
